app/Controllers/AccueilController.php

SELECT *
FROM "promotion"
---
    public function index(){

        $produitModel = new ProduitModel();
        $listeProduitAcceuil = $produitModel->getProduitAffichageAcceuil();

        $promotionModel = new PromotionModel();
        $listePromotion = $promotionModel->findAll();