app/Controllers/ArticleController.php

SELECT *
FROM "article"
WHERE   (
LOWER(titredocument) LIKE '%%' ESCAPE '!'
OR  LOWER(descriptiondocument) LIKE '%%' ESCAPE '!'
 )
AND "blog" = FALSE
 LIMIT 3
SELECT COUNT(*) AS "numrows"
FROM "article"
WHERE   (
LOWER(titredocument) LIKE '%%' ESCAPE '!'
OR  LOWER(descriptiondocument) LIKE '%%' ESCAPE '!'
 )
AND "blog" = FALSE
---
	public function indexActu()
	{
		$articleModel = new ArticleModel();

		$keyword = $this->request->getGet('keyword');
		if ($keyword === null) {
			$keyword = '';
		}
		$keyword = strtolower($keyword);

		$configPager = config(Pager::class);
		$perPage = $configPager->perPage;
		$perPage = 3;  // Limite des tâches par statut
    	$currentPage = $this->request->getVar('page') ?? 1;

		$articles = $articleModel
					->groupStart()
						->like('LOWER(titredocument)', $keyword)
						->orLike('LOWER(descriptiondocument)', $keyword)
					->groupEnd()
					->where('blog', false)
					->paginate($perPage, 'default');

SELECT *
FROM "article"
WHERE   (
LOWER(titredocument) LIKE '%dqsd%' ESCAPE '!'
OR  LOWER(descriptiondocument) LIKE '%dqsd%' ESCAPE '!'
 )
AND "blog" = TRUE
 LIMIT 3
SELECT COUNT(*) AS "numrows"
FROM "article"
WHERE   (
LOWER(titredocument) LIKE '%dqsd%' ESCAPE '!'
OR  LOWER(descriptiondocument) LIKE '%dqsd%' ESCAPE '!'
 )
AND "blog" = TRUE
---
	public function indexBlog()
	{
		$articleModel = new ArticleModel();

		$keyword = $this->request->getGet('keyword');
		if ($keyword === null) {
			$keyword = '';
		}
		$keyword = strtolower($keyword);

		$configPager = config(Pager::class);
		$perPage = $configPager->perPage;
		$perPage = 3;  // Limite des tâches par statut
    	$currentPage = $this->request->getVar('page') ?? 1;

		$articles = $articleModel
					->groupStart()
						->like('LOWER(titredocument)', $keyword)
						->orLike('LOWER(descriptiondocument)', $keyword)
					->groupEnd()
					->where('blog', true)
					->paginate($perPage, 'default');