app/Controllers/BlogController.php

SELECT *
FROM "article"
WHERE "article"."iddocument" = '19'
---
	public function edition()
	{
		$articleModel = new ArticleModel();
		$iddocument = $this->request->getPost('iddocument');
		echo 'iddocumentController : ' . $iddocument . '<br>';

		$titre = $this->request->getPost('titredocument');
		$description = $this->request->getPost('descriptiondocument');
		$supprimerImage = $this->request->getPost('supprimer_image');
		$article = $articleModel->find($iddocument);