app/Controllers/BoardController.php

SELECT *
FROM "client"
---
	public function board()
	{
		$clientModel = new ClientModel();

		$clients = $clientModel->findAll();