app/Controllers/MdpOublieController.php

SELECT *
FROM "client"
WHERE "mail" = 'gaetanldx@hotmail.com'
 LIMIT 1
UPDATE "client" SET "token" = '664f3382af82f8028e51c1e8d3e7221a4d146c8e133f254254c3a18e1bffc7fc'
WHERE "client"."idclient" IN ('17')
---
	public function envoyerEmail()
	{
		$email = $this->request->getPost('email');
		$clientModel = new ClientModel();
		$client = $clientModel->where('mail', $email)->first();

		if (!$client) {
			return redirect()->back()->with('error', 'Adresse email non trouvée.');
		}

		$token = bin2hex(random_bytes(32));
		$clientModel->update($client['idclient'], ['token' => $token]);