app/Controllers/PaiementController.php

SELECT *
FROM "client"
WHERE "client"."idclient" = '17'
SELECT *
FROM "produit"
WHERE "produit"."idproduit" = '1'
---
	public function afficherPagePaiement()
	{
		$session = session();
		$clientId = $session->get('client_id');
		$produitId = $session->get('produit_id');

		if (!$clientId || !$produitId) {
			return redirect()->to('/')->with('error', 'Session invalide ou expirée.');
		}

		$clientModel = new ClientModel();
		$produitModel = new ProduitModel();

		$client = $clientModel->find($clientId);
		$produit = $produitModel->find($produitId);