app/Controllers/ProduitController.php

	   public function indexDashboard()
    {


        // Chargement des modèles
        $product = new ProduitModel();
        $promotion = new PromotionModel();

		$configPager = config(Pager::class);
		$perPage = 2;


        // Utilisation de la méthode paginate
        $productListe = $product->findAll();
---
SELECT *
FROM "produit"

    public function indexProduct($idproduit)
    {

        // Chargement du modèle
        $product = new ProduitModel();
        $achat = new AcheterModel();

		$perPage = 3;
		$prod = $product->getProduit($idproduit);


        $listeAchat = $achat->where('idproduit', $idproduit)->paginate($perPage,'group_achats');
---
SELECT *
FROM "acheter"
WHERE "idproduit" = '1'
 LIMIT 3 OFFSET 3
SELECT COUNT(*) AS "numrows"
FROM "acheter"
WHERE "idproduit" = '1'