app/Controllers/ProduitController.php

	public function indexDashboard(){


        // Chargement des modèles
        $product = new ProduitModel();
        $promotion = new PromotionModel();

        $orderbyProd = $this->request->getVar('orderbyProd') ?? 'idproduit';
        $orderProd = strtoupper($this->request->getVar('orderProd')) === 'ASC' ? 'ASC' : 'DESC';

        $validColumnsProd = ['idproduit', 'titreproduit', 'descriptionproduit', 'prix'];
		if (!in_array($orderbyProd, $validColumnsProd)) {
			$orderbyProd = 'idproduit';
		}


        /*orderby Prom*/
        $orderbyProm = $this->request->getVar('orderbyProm') ?? 'iddocument';
        $orderProm = strtoupper($this->request->getVar('orderProm')) === 'ASC' ? 'ASC' : 'DESC';

        $validColumnsProm = ['iddocument', 'titredocument', 'descriptiondocument', 'reductionpromo','codepromo'];
		if (!in_array($orderbyProm, $validColumnsProm)) {
			$orderbyProm = 'iddocument';
		}

		$configPager = config(Pager::class);
		$perPage = 2;


        // Utilisation de la méthode paginate
        $productListe = $product->orderBy($orderbyProd, $orderProd)
                                ->findAll();
---
SELECT *
FROM "produit"
ORDER BY "idproduit" DESC