app/Controllers/ProfileController.php

SELECT *
FROM "client"
WHERE "client"."idclient" = '18'
---
	public function modifier()
	{
		$clientId = session()->get('idClient');