app/Controllers/PromotionController.php

SELECT *
FROM "promotion"
---
    public function index(){

        $promotionModel = new PromotionModel();
        $listePromotion = $promotionModel->findAll();