app/Models/AcheterModel.php

	public function getAcheter($idclient, $idproduit)
	{
		return $this->where('idclient', $idclient)
			->where('idproduit', $idproduit)
			->first();
---
SELECT *
FROM "acheter"
WHERE "idclient" = '17'
AND "idproduit" = '1'
 LIMIT 1

	public function getProduitsAchetes($idClient)
	{
		return $this->select('produit.*')
			->join('produit', 'acheter.idproduit = produit.idproduit')
			->where('acheter.idclient', $idClient)
			->findAll();
---
SELECT "produit".*
FROM "acheter"
JOIN "produit" ON "acheter"."idproduit" = "produit"."idproduit"
WHERE "acheter"."idclient" = '17'

	public function getCommentaire($idclient){
		return $this->where('idclient',$idclient)->findAll();
---
SELECT *
FROM "acheter"
WHERE "idclient" = '17'

	public function getAcheterProduit($idproduit)
	{
		return $this->where('idproduit', $idproduit)->findAll();
---
SELECT *
FROM "acheter"
WHERE "idproduit" = '1'