app/Models/ArticleModel.php

UPDATE "article" SET "titredocument" = 'titre', "descriptiondocument" = 'cars weepoo', "image" = '1733240690_54beadefa2a451a8761e.jpg'
WHERE "iddocument" = '19'
---
    public function majArticle($idDocument, $articleDonnee)
    {
        return $this->update($idDocument, $articleDonnee);