app/Models/ClientModel.php

SELECT *
FROM "client"
WHERE "admin" = TRUE
 LIMIT 1
---
	public function getAdmin()
	{
		return $this->where('admin', true)->first();