app/Models/ProduitModel.php

SELECT *
FROM "produit"
WHERE "idproduit" = '1'
 LIMIT 1
---
	public function getProduit($idproduit)
	{
		return $this->where('idproduit', $idproduit)->first();

SELECT *
FROM "produit"
WHERE "affichage" = TRUE
---
	public function getProduitAffichage()
	{
		return $this->where('affichage',true)->findAll();

SELECT *
FROM "produit"
WHERE "affichageaccueil" = 't'
---
	public function getProduitAffichageAcceuil()
	{
		return $this->where('affichageaccueil','t')->findAll();