app/Models/PromotionModel.php

SELECT *
FROM "promotion"
WHERE "active" = TRUE
---
	public function getActivePromotion()
	{
		return $this->where('active', true)->findAll();

INSERT INTO "promotion" ("titredocument", "descriptiondocument", "active", "reductionpromo", "codepromo") VALUES ('test', 'test', FALSE, '202', '2555OUI')
---
	public function creerPromotion($promotionDonnee)
	{
		return $this->insert($promotionDonnee);